import sys

#DP
#골드 3

N=int(sys.stdin.readline())
dp=[[0]*5 for _ in range(N+2)] #(2가 나오적 X 0, 2가 나온적 있는 0, 2가 나온적 X 1, 2가 나오적 있는 1, 2)

dp[1]=[1,0,0,0,0]
dp[2]=[1,0,1,0,1]

mod=1000000007

for i in range(3,N+1):
    dp[i][0]=(dp[i-1][0]+dp[i-1][2])%mod # 2가 한번도 나온적 없는 경우, 0->0 , 1->0 가능
    dp[i][1]=(dp[i-1][1]+dp[i-1][3]+dp[i-1][4])%mod # 2가 한번 이상 나온적 있는 경우, 0->0, 1->0, 2->0 가능
    dp[i][2]=(2*dp[i-2][0]+dp[i-2][2])%mod # 2가 한번도 나온 적 없는 경우, 0->0->1/ 0->1->1 / 1->0->1  가능
    dp[i][3]=(dp[i-2][0]+3*dp[i-2][1]+dp[i-2][3]+dp[i-2][4])%mod #2가 한번이상 나온 적 있는 경우  0->0->1/ 0->1->1 /0->2->1/ 1->0->1 / 2->0->1 가능
    dp[i][4]=(2*(dp[i-2][0]+dp[i-2][1])+(dp[i-2][2]+dp[i-2][3])+dp[i-2][4])%mod # 0->0->2 / 0->1->2 / 1->0->2 / 2->0->2 가능 

#print(dp)
print((dp[N][1]+dp[N][3]+dp[N][4])%mod) # 2가 1번 이상 나와야 함.